MyNetwork(
  (conv1): Conv2d(3, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
  (convStack1): Sequential(
    (0): ImprovedBlock(
      (bn1): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(16, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (projection): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (1): ImprovedBlock(
      (bn1): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (2): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (3): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (4): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (5): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (6): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (7): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (8): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (9): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (10): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (11): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (12): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (13): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (14): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (15): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (16): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (17): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(16, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn4): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(16, 16, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
  )
  (convStack2): Sequential(
    (0): ImprovedBlock(
      (bn1): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(64, 32, kernel_size=(1, 1), stride=(2, 2), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (projection): Conv2d(64, 128, kernel_size=(1, 1), stride=(2, 2), bias=False)
    )
    (1): ImprovedBlock(
      (bn1): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (2): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (3): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (4): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (5): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (6): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (7): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (8): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (9): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (10): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (11): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (12): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (13): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (14): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (15): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (16): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (17): ImprovedBlock(
      (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn4): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
  )
  (convStack3): Sequential(
    (0): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(128, 64, kernel_size=(1, 1), stride=(2, 2), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (projection): Conv2d(128, 256, kernel_size=(1, 1), stride=(2, 2), bias=False)
    )
    (1): ImprovedBlock(
      (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (2): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (3): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (4): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (5): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (6): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (7): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (8): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (9): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (10): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (11): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (12): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (13): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (14): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (15): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (16): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
    (17): ImprovedBlock(
      (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn3): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (bn4): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      (conv3): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
    )
  )
  (linear): Linear(in_features=256, out_features=10, bias=True)
)
1.986914366198043
score = 32.480% (1.9663) in validation set.

Best loss yet!
Saving...
1.7071984339826785
score = 36.980% (1.8504) in validation set.

Best loss yet!
Saving...
1.5702663915225874
score = 42.100% (1.8099) in validation set.

Best loss yet!
Saving...
1.4610403585738647
score = 45.100% (1.6965) in validation set.

Best loss yet!
Saving...
1.3627081686696305
score = 50.400% (1.5198) in validation set.

Best loss yet!
Saving...
1.2823562085057219
score = 55.250% (1.3714) in validation set.

Best loss yet!
Saving...
1.2114036614521624
score = 59.890% (1.2307) in validation set.

Best loss yet!
Saving...
1.141533603302587
score = 57.210% (1.3206) in validation set.

best was 1 epochs ago
1.0860948756860849
score = 64.640% (1.0996) in validation set.

Best loss yet!
Saving...
1.0296370387077332
score = 61.420% (1.2017) in validation set.

best was 1 epochs ago
0.9831733004734539
score = 66.430% (1.0383) in validation set.

Best loss yet!
Saving...
0.9401036390481284
score = 69.470% (0.9364) in validation set.

Best loss yet!
Saving...
0.9079489231871339
score = 69.190% (0.9805) in validation set.

best was 1 epochs ago
0.8663501560497588
score = 69.460% (0.9700) in validation set.

best was 2 epochs ago
0.8384988770698206
score = 68.320% (1.0082) in validation set.

best was 3 epochs ago
0.8002955576482291
score = 67.850% (1.0172) in validation set.

best was 4 epochs ago
0.7684137845953433
score = 74.860% (0.8127) in validation set.

Best loss yet!
Saving...
0.7419160400716641
score = 73.250% (0.8417) in validation set.

best was 1 epochs ago
0.7149863237390122
score = 74.530% (0.8056) in validation set.

Best loss yet!
Saving...
0.6890751567130653
score = 75.390% (0.7789) in validation set.

Best loss yet!
Saving...
0.6674171189149729
score = 73.540% (0.8733) in validation set.

best was 1 epochs ago
0.6415018773497865
score = 75.810% (0.7678) in validation set.

Best loss yet!
Saving...
0.6216348183040802
score = 77.290% (0.7483) in validation set.

Best loss yet!
Saving...
0.6060555312580194
score = 76.320% (0.7642) in validation set.

best was 1 epochs ago
0.5896190327767747
score = 77.950% (0.7013) in validation set.

Best loss yet!
Saving...
0.568158774044567
score = 78.110% (0.7066) in validation set.

best was 1 epochs ago
0.556636250533235
score = 80.610% (0.6307) in validation set.

Best loss yet!
Saving...
0.5398227234427541
score = 80.970% (0.6242) in validation set.

Best loss yet!
Saving...
0.5278025957913445
score = 79.900% (0.6751) in validation set.

best was 1 epochs ago
0.5071744163767599
score = 79.360% (0.6890) in validation set.

best was 2 epochs ago
0.5023148087457346
score = 80.510% (0.6287) in validation set.

best was 3 epochs ago
0.4907677198370425
score = 81.870% (0.6031) in validation set.

Best loss yet!
Saving...
0.47611612652818236
score = 80.830% (0.6320) in validation set.

best was 1 epochs ago
0.4643811177902709
score = 82.730% (0.5761) in validation set.

Best loss yet!
Saving...
0.45422195493222806
score = 81.450% (0.6098) in validation set.

best was 1 epochs ago
0.4421866171466657
score = 82.230% (0.5871) in validation set.

best was 2 epochs ago
0.43953673203532306
score = 83.020% (0.5670) in validation set.

Best loss yet!
Saving...
0.4212808148643841
score = 83.430% (0.5555) in validation set.

Best loss yet!
Saving...
0.41867760633127377
score = 83.100% (0.5617) in validation set.

best was 1 epochs ago
0.40961673879585325
score = 83.250% (0.5655) in validation set.

best was 2 epochs ago
0.39820017939367996
score = 83.300% (0.5807) in validation set.

best was 3 epochs ago
0.39113630316318415
score = 84.120% (0.5328) in validation set.

Best loss yet!
Saving...
0.38310848933439284
score = 83.150% (0.5701) in validation set.

best was 1 epochs ago
0.37725133908251984
score = 84.220% (0.5495) in validation set.

best was 2 epochs ago
0.3744968489145699
score = 81.560% (0.6591) in validation set.

best was 3 epochs ago
0.36435855882236373
score = 83.960% (0.5579) in validation set.

best was 4 epochs ago
0.35401077449512175
score = 82.430% (0.5930) in validation set.

best was 5 epochs ago
0.34600029214502526
score = 84.920% (0.5307) in validation set.

Best loss yet!
Saving...
0.34294500837501246
score = 83.860% (0.5617) in validation set.

best was 1 epochs ago
0.334560540204231
score = 82.890% (0.6256) in validation set.

best was 2 epochs ago
0.328465265778307
score = 83.690% (0.5709) in validation set.

best was 3 epochs ago
0.3288080014121799
score = 85.870% (0.4741) in validation set.

Best loss yet!
Saving...
0.3174942080586101
score = 86.000% (0.4846) in validation set.

best was 1 epochs ago
0.31539124907396093
score = 84.800% (0.5454) in validation set.

best was 2 epochs ago
0.3102494502981631
score = 84.860% (0.5056) in validation set.

best was 3 epochs ago
0.30085304131903967
score = 84.920% (0.5382) in validation set.

best was 4 epochs ago
0.29447470667263187
score = 83.190% (0.6011) in validation set.

best was 5 epochs ago
0.2882916367949007
score = 84.610% (0.5554) in validation set.

best was 6 epochs ago
0.2885708876025562
score = 85.460% (0.5296) in validation set.

best was 7 epochs ago
0.2794015510870626
score = 84.420% (0.5581) in validation set.

best was 8 epochs ago
0.2722393081020623
score = 85.540% (0.5300) in validation set.

best was 9 epochs ago
0.27367324851001035
score = 86.140% (0.4994) in validation set.

best was 10 epochs ago
0.2644787538832369
score = 84.140% (0.5874) in validation set.

best was 11 epochs ago
0.26360624195478216
score = 85.880% (0.5078) in validation set.

best was 12 epochs ago
0.26230325571264324
score = 85.190% (0.5449) in validation set.

best was 13 epochs ago
0.25644023652179554
score = 85.630% (0.5145) in validation set.

best was 14 epochs ago
0.25746933723124454
score = 85.010% (0.5530) in validation set.

best was 15 epochs ago
0.251987771104319
score = 85.190% (0.5429) in validation set.

best was 16 epochs ago
0.2486063623771119
score = 84.580% (0.5732) in validation set.

best was 17 epochs ago
0.24311633729420531
score = 85.320% (0.5546) in validation set.

best was 18 epochs ago
0.23967649313969352
score = 86.390% (0.5039) in validation set.

best was 19 epochs ago
0.2353904803816122
score = 85.420% (0.5749) in validation set.

best was 20 epochs ago
0.2297288929216397
score = 85.150% (0.5678) in validation set.

best was 21 epochs ago
0.23006703914068757
score = 86.240% (0.5102) in validation set.

best was 22 epochs ago
0.22943499243964022
score = 86.210% (0.5365) in validation set.

best was 23 epochs ago
0.22259318150175264
score = 86.950% (0.4924) in validation set.

best was 24 epochs ago
0.22266719483148556
score = 84.670% (0.5825) in validation set.

best was 25 epochs ago
0.2251010171521586
score = 87.330% (0.4881) in validation set.

best was 26 epochs ago
0.21682936538713046
score = 86.380% (0.5154) in validation set.

best was 27 epochs ago
0.2135325182264986
score = 86.420% (0.5195) in validation set.

best was 28 epochs ago
0.20727196385780464
score = 86.030% (0.5437) in validation set.

best was 29 epochs ago
0.20517196751440675
score = 87.150% (0.5070) in validation set.

best was 30 epochs ago
0.20856413438011662
score = 86.210% (0.5448) in validation set.

best was 31 epochs ago
0.1980873955943333
score = 87.520% (0.4851) in validation set.

best was 32 epochs ago
0.20366065356487664
score = 87.140% (0.4959) in validation set.

best was 33 epochs ago
0.19993763267041775
score = 87.200% (0.5052) in validation set.

best was 34 epochs ago
0.20168663028139658
score = 87.050% (0.5009) in validation set.

best was 35 epochs ago
0.1961395675524736
score = 87.210% (0.4685) in validation set.

Best loss yet!
Saving...
0.1874275742628323
score = 83.510% (0.6816) in validation set.

best was 1 epochs ago
0.18866368933036304
score = 85.830% (0.5494) in validation set.

best was 2 epochs ago
0.19128175194080646
score = 86.710% (0.5053) in validation set.

best was 3 epochs ago
0.18828962895626458
score = 86.480% (0.5222) in validation set.

best was 4 epochs ago
0.18492421043661836
score = 86.060% (0.5343) in validation set.

best was 5 epochs ago
0.18650777233294405
score = 86.750% (0.5103) in validation set.

best was 6 epochs ago
0.1810236670100651
score = 85.530% (0.6342) in validation set.

best was 7 epochs ago
0.1843328228392921
score = 86.160% (0.5875) in validation set.

best was 8 epochs ago
0.1742028372165875
score = 82.450% (0.8318) in validation set.

best was 9 epochs ago
0.1793000623345756
score = 86.770% (0.5453) in validation set.

best was 10 epochs ago
0.17505102461804978
score = 84.950% (0.6102) in validation set.

best was 11 epochs ago
0.17143765646523942
score = 88.160% (0.4712) in validation set.

best was 12 epochs ago
0.1316962271643142
score = 90.390% (0.3708) in validation set.

Best loss yet!
Saving...
0.11217624207916922
score = 90.520% (0.3653) in validation set.

Best loss yet!
Saving...
0.1074621853070518
score = 90.730% (0.3652) in validation set.

Best loss yet!
Saving...
0.10230000048114088
score = 90.590% (0.3687) in validation set.

best was 1 epochs ago
0.10033941021361671
score = 90.430% (0.3702) in validation set.

best was 2 epochs ago
0.09763275864072882
score = 90.570% (0.3684) in validation set.

best was 3 epochs ago
0.09275307142720245
score = 90.740% (0.3743) in validation set.

best was 4 epochs ago
0.09347567097923626
score = 90.650% (0.3736) in validation set.

best was 5 epochs ago
0.09204839528820956
score = 90.600% (0.3736) in validation set.

best was 6 epochs ago
0.08980333093351449
score = 90.830% (0.3751) in validation set.

best was 7 epochs ago
0.08754021952898738
score = 90.500% (0.3771) in validation set.

best was 8 epochs ago
0.08797972804060378
score = 90.710% (0.3730) in validation set.

best was 9 epochs ago
0.0872407160854092
score = 90.670% (0.3766) in validation set.

best was 10 epochs ago
0.08834972794349201
score = 90.650% (0.3802) in validation set.

best was 11 epochs ago
0.08607238342170231
score = 90.690% (0.3772) in validation set.

best was 12 epochs ago
0.08239368132699412
score = 90.600% (0.3754) in validation set.

best was 13 epochs ago
0.08448055199386117
score = 90.720% (0.3778) in validation set.

best was 14 epochs ago
0.08223352367028641
score = 90.530% (0.3836) in validation set.

best was 15 epochs ago
0.07938260147377801
score = 90.520% (0.3813) in validation set.

best was 16 epochs ago
0.07995983843093578
score = 90.810% (0.3784) in validation set.

best was 17 epochs ago
0.07558080872383932
score = 90.820% (0.3815) in validation set.

best was 18 epochs ago
0.07608037717200031
score = 90.610% (0.3874) in validation set.

best was 19 epochs ago
0.08077417374157106
score = 90.780% (0.3858) in validation set.

best was 20 epochs ago
0.07709097179670493
score = 90.700% (0.3837) in validation set.

best was 21 epochs ago
0.08062058493209343
score = 90.740% (0.3846) in validation set.

best was 22 epochs ago
0.07777547594992973
score = 90.740% (0.3848) in validation set.

best was 23 epochs ago
0.07616431352655632
score = 90.670% (0.3875) in validation set.

best was 24 epochs ago
0.07921829805992091
score = 90.790% (0.3897) in validation set.

best was 25 epochs ago
0.07448396191726954
score = 90.830% (0.3849) in validation set.

best was 26 epochs ago
0.07761371582032392
score = 90.940% (0.3865) in validation set.

best was 27 epochs ago
0.07347890494849545
score = 90.730% (0.3899) in validation set.

best was 28 epochs ago
0.07436802001675955
score = 90.790% (0.3815) in validation set.

best was 29 epochs ago
0.07583189910402693
score = 90.820% (0.3855) in validation set.

best was 30 epochs ago
0.07547621925275166
score = 90.770% (0.3954) in validation set.

best was 31 epochs ago
0.07584296304066056
score = 90.740% (0.3864) in validation set.

best was 32 epochs ago
0.07629180920069305
score = 90.740% (0.3915) in validation set.

best was 33 epochs ago
0.07331472153242785
score = 90.670% (0.3885) in validation set.

best was 34 epochs ago
0.07006760310536375
score = 90.830% (0.3862) in validation set.

best was 35 epochs ago
0.07053398939902886
score = 90.890% (0.3881) in validation set.

best was 36 epochs ago
0.07039916171088291
score = 91.010% (0.3887) in validation set.

best was 37 epochs ago
0.07539027414251916
score = 90.900% (0.3915) in validation set.

best was 38 epochs ago
0.07057807085137018
score = 90.750% (0.3999) in validation set.

best was 39 epochs ago
0.07019796641394734
score = 90.790% (0.3917) in validation set.

best was 40 epochs ago
0.07047602234069056
score = 90.810% (0.3931) in validation set.

best was 41 epochs ago
0.06933710325997287
score = 90.860% (0.3966) in validation set.

best was 42 epochs ago
0.06952681805724248
score = 90.900% (0.3970) in validation set.

best was 43 epochs ago
0.06728118378073929
score = 90.950% (0.3976) in validation set.

best was 44 epochs ago
0.07081611196811016
score = 90.770% (0.3954) in validation set.

best was 45 epochs ago
0.06912304708412803
score = 90.990% (0.3998) in validation set.

best was 46 epochs ago
0.07014822107129776
score = 91.010% (0.3939) in validation set.

best was 47 epochs ago
0.067818984192924
score = 90.890% (0.3936) in validation set.

best was 48 epochs ago
0.06906247439202123
score = 90.770% (0.4003) in validation set.

best was 49 epochs ago
0.06739813242309962
score = 90.810% (0.3995) in validation set.

best was 50 epochs ago
0.0694890299621529
score = 90.820% (0.3973) in validation set.

best was 51 epochs ago
0.06964998208759977
score = 90.850% (0.3982) in validation set.

best was 52 epochs ago
0.06754606092473664
score = 90.860% (0.4033) in validation set.

best was 53 epochs ago
0.06990738842672052
score = 90.980% (0.3933) in validation set.

best was 54 epochs ago
0.06893507826823396
score = 90.930% (0.3997) in validation set.

best was 55 epochs ago
0.06842359753783804
score = 90.850% (0.4056) in validation set.

best was 56 epochs ago
0.06382820343438048
score = 91.020% (0.3920) in validation set.

best was 57 epochs ago
0.06695603315953534
score = 90.970% (0.4008) in validation set.

best was 58 epochs ago
0.06491101807959307
score = 90.930% (0.4065) in validation set.

best was 59 epochs ago
0.06553485744986862
score = 90.890% (0.3971) in validation set.

best was 60 epochs ago
0.06881174891770553
score = 90.860% (0.3983) in validation set.

best was 61 epochs ago
0.06324495852124482
score = 90.910% (0.3986) in validation set.

best was 62 epochs ago
0.06387828816228305
score = 91.070% (0.3938) in validation set.

best was 63 epochs ago
0.06468147839517735
score = 90.840% (0.4006) in validation set.

best was 64 epochs ago
0.06413738391460322
score = 90.970% (0.3987) in validation set.

best was 65 epochs ago
0.062239244865914124
score = 90.840% (0.3936) in validation set.

best was 66 epochs ago
0.06310620674262413
score = 91.040% (0.3996) in validation set.

best was 67 epochs ago
0.06303809892041043
score = 90.900% (0.4049) in validation set.

best was 68 epochs ago
0.0655168310468332
score = 90.920% (0.4028) in validation set.

best was 69 epochs ago
0.06276753437095367
score = 90.960% (0.4076) in validation set.

best was 70 epochs ago
0.06444201968348445
score = 90.930% (0.4053) in validation set.

best was 71 epochs ago
0.06180157053608674
score = 90.870% (0.4074) in validation set.

best was 72 epochs ago
0.06331813451164542
score = 90.910% (0.4077) in validation set.

best was 73 epochs ago
0.06126787508733737
score = 90.880% (0.4131) in validation set.

best was 74 epochs ago
0.06395145643579836
score = 90.810% (0.4087) in validation set.

best was 75 epochs ago
0.06452956264570783
score = 90.790% (0.4110) in validation set.

best was 76 epochs ago
0.06123856743708396
score = 90.930% (0.3993) in validation set.

best was 77 epochs ago
0.058745813805955095
score = 90.760% (0.4077) in validation set.

best was 78 epochs ago
0.06535616181136225
score = 90.990% (0.4091) in validation set.

best was 79 epochs ago
0.06371630346789338
score = 90.910% (0.4049) in validation set.

best was 80 epochs ago
0.06331491306388436
score = 91.040% (0.4043) in validation set.

best was 81 epochs ago
0.059535048146265
score = 91.070% (0.4061) in validation set.

best was 82 epochs ago
0.0596922623356596
score = 90.930% (0.4058) in validation set.

best was 83 epochs ago
0.062307468255440264
score = 90.830% (0.4084) in validation set.

best was 84 epochs ago
0.0602734776231618
score = 90.820% (0.4071) in validation set.

best was 85 epochs ago
0.059745812761826445
score = 91.050% (0.4042) in validation set.

best was 86 epochs ago
0.06315147630519237
score = 90.990% (0.4026) in validation set.

best was 87 epochs ago
0.06145389792554009
score = 90.810% (0.4150) in validation set.

best was 88 epochs ago
0.06355868651272771
score = 91.070% (0.4019) in validation set.

best was 89 epochs ago
0.06254108922002605
score = 90.820% (0.4160) in validation set.

best was 90 epochs ago
0.06254215103785356
score = 90.890% (0.4103) in validation set.

best was 91 epochs ago
0.05918414975567081
score = 91.060% (0.4103) in validation set.

best was 92 epochs ago
0.0596984458578447
score = 90.800% (0.4142) in validation set.

best was 93 epochs ago
0.06111104292765308
score = 90.870% (0.4166) in validation set.

best was 94 epochs ago
0.06364285467436519
score = 91.140% (0.3984) in validation set.

best was 95 epochs ago
0.060227657076173696
score = 91.060% (0.3990) in validation set.

best was 96 epochs ago
0.05886143368160049
score = 90.950% (0.4064) in validation set.

best was 97 epochs ago
0.05811025693524664
score = 91.060% (0.4015) in validation set.

best was 98 epochs ago
0.059678755209635434
score = 91.020% (0.3979) in validation set.

best was 99 epochs ago
0.0584198135358933
score = 90.970% (0.3978) in validation set.

best was 100 epochs ago
0.05301417904153181
score = 91.030% (0.3966) in validation set.

best was 101 epochs ago
0.05487524910559193
score = 91.130% (0.3984) in validation set.

best was 102 epochs ago
0.05641170228405978
score = 91.050% (0.3972) in validation set.

best was 103 epochs ago
0.05690308671278028
score = 91.020% (0.3961) in validation set.

best was 104 epochs ago
0.05849774973913313
score = 91.090% (0.3980) in validation set.

best was 105 epochs ago
0.05397450444868769
score = 91.100% (0.3992) in validation set.

best was 106 epochs ago
0.05509554454015372
score = 91.140% (0.3980) in validation set.

best was 107 epochs ago
